devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
        return true;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static bool I2C_start(I2C_dev_t *hdl)
{
        SET_BIT(get_I2C(hdl)->CR1, I2C_CR1_START);
        return wait_for_event(hdl);
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static bool I2C_send_address(I2C_dev_t *hdl, bool wr)
{
        I2C_t *i2c = get_I2C(hdl);

        u16_t SR1 = i2c->SR1;
        (void)SR1;

        if (hdl->config->addr10bit) {
                i2c->DR = header10b | ((hdl->config->addr & 0x300) >> 7);
                if (!wait_for_event(hdl))
                        return false;

                SR1 = i2c->SR1;
                i2c->DR = hdl->config->addr;
                if (!wait_for_event(hdl))
                        return false;

                if (!wr) {
                        if (!I2C_start(hdl))
                                return false;

                        i2c->DR = header10b | ((hdl->config->addr & 0x300) >> 7) | 0x01;
                        if (!wait_for_event(hdl))
                                return false;
                }
        } else {
                u8_t addr = hdl->config->addr & 0xFE;

                if (!wr)
                        addr |= 0x01;

                i2c->DR = hdl->config->addr;
                if (!wait_for_event(hdl))
                        return false;
        }

        return true;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static bool I2C_send_sub_address(I2C_dev_t *hdl, I2C_sub_addr_mode_t mode, u32_t addr)
{
        I2C_t *i2c = get_I2C(hdl);

        switch (mode) {
        default:
                break;

        case I2C_SUB_ADDR_MODE__3_BYTES:
                i2c->DR = addr >> 24;
                if (!wait_for_event(hdl))
                        return false;
                // flow through

        case I2C_SUB_ADDR_MODE__2_BYTES:
                i2c->DR = addr >> 16;
                if (!wait_for_event(hdl))
                        return false;
                // flow through

        case I2C_SUB_ADDR_MODE__1_BYTE:
                i2c->DR = addr;
                if (!wait_for_event(hdl))
                        return false;
                break;
        }

        return true;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static ssize_t I2C_transmit(I2C_dev_t *hdl, const u8_t *src, size_t size)
{

}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static ssize_t I2C_receive(I2C_dev_t *hdl, u8_t *dst, size_t size)
{

}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static bool I2C_stop(I2C_dev_t *hdl)
{

}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
static bool IRQ_handler(u8_t major, bool error)
{
        I2C->periph[major].error = error;

        bool woken = false;
        semaphore_signal_from_ISR(I2C->periph[major].event, &woken);

        return woken;
}

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
void I2C1_EV_IRQHandler(void)
{
        IRQ_handler(_I2C1, false);
}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
void I2C1_ER_IRQHandler(void)
{
        IRQ_handler(_I2C1, true);
}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
void I2C2_EV_IRQHandler(void)
{
        IRQ_handler(_I2C2, false);
}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
void I2C2_ER_IRQHandler(void)
{
        IRQ_handler(_I2C2, true);
}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0) && (_I2C2_USE_DMA > 0)
void DMA1_Channel4_IRQHandler(void)
{

}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0) && (_I2C2_USE_DMA > 0)
void DMA1_Channel5_IRQHandler(void)
{

}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0) && (_I2C1_USE_DMA > 0)
void DMA1_Channel6_IRQHandler(void)
{

}
#endif

//==============================================================================
/**
 * @brief
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0) && (_I2C1_USE_DMA > 0)
void DMA1_Channel7_IRQHandler(void)
{

}
#endif

/*==============================================================================
  End of file
==============================================================================*/
